xml4test/work.txt.xml.trans

<?xml version="1.0" encoding="UTF-8" standalone="no"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:env="env" xmlns:p2p="http://engine.paymentgate.ru/webservices/p2p">
<soapenv:Header>
<wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" env:mustUnderstand="1" soapenv:mustUnderstand="1">
<wsse:UsernameToken wsu:Id="UsernameToken-UUID">
<wsse:Username>test_AVS-api</wsse:Username>
<wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">test_AVS</wsse:Password>
</wsse:UsernameToken>
    </wsse:Security>
	</soapenv:Header>
	    <soapenv:Body>
        <p2p:registerP2P>
            <arg0 language="RU">
                <amount>500</amount>
                <!--[tqqqqq>frags<--><currency>643</currency><orderNumber>1</orderNumber><orderDescription>Хознужды</orderDescription>
                <returnUrl>https://avs.com.ru</returnUrl>
                <failUrl>https://avs.com.ru</failUrl>
                <sessionTimeoutSecs>300</sessionTimeoutSecs>
                <email>metal@avs.com.ru</email>
                <params name="mark" value="1"/>
                <transactionTypeIndicator>A</transactionTypeIndicator>
                <features>
                    <feature>WITHOUT_FROM_CARD</feature>
                </features>
                <creditBindingId/><sbpSenderParams account="?"/>
            </arg0>
        </p2p:registerP2P>
    </soapenv:Body>
</soapenv:Envelope>